# taps
tap "adoptopenjdk/openjdk"
tap "heroku/brew"


# osx essentials
cask "notion"
cask "iterm2"
# brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "rectangle"

# dev essentials
brew "gh"
brew "hub"
cask "visual-studio-code"
cask "datagrip"

# python
# brew "python@3.9"

# go
brew "go"

# node
# brew "volta"
brew "nvm"
brew "yarn"

# vim plugin needs
brew "neovim"
brew "fzf"
brew "the_silver_searcher"
brew "zlib"

# developer tooling
brew "nginx"
cask "inso"
cask "insomnia"
cask "ngrok"
brew "pgcli"
brew "cloud-sql-proxy"
# required for doppler
brew "gnupg"
brew "direnv"

# Utils
brew "readline"
brew "jq"
brew "libyaml"
brew "imagemagick"
brew "gpg"
brew "libpq"


# required for refi
cask "chromedriver"

# kubernetes and friends
# brew "helm"
# brew "k3d"
# brew "kind"
# brew "kubernetes-cli"
# terraform
# tap "hashicorp/tap"
# brew "hashicorp/tap/terraform"

# misc / to categorize
# brew "autoconf"
# brew "automake"
# brew "coreutils"
# brew "glib"
# brew "sqlite"
# brew "httpie"
# brew "libheif"
# brew "tcl-tk"
# brew "libtool"
# brew "libksba"
# brew "pkg-config"
# cask "adoptopenjdk11"
# cask "stack"

