# taps
tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# osx essentials
cask "notion"
cask "iterm2"
# brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "rectangle"

# dev essentials
brew "gh"
brew "hub"
cask "visual-studio-code"

# python
# brew "python@3.9"

# go
# brew "go"

# node
# brew "volta"
brew "nvm"
brew "yarn"
#
#
# ruby
# brew "rbenv"
# brew "ruby-build"

# terraform
# tap "hashicorp/tap"
# brew "hashicorp/tap/terraform"

# vim plugin needs
brew "neovim"
brew "fzf"
brew "the_silver_searcher"
brew "zlib"

# kubernetes and friends
# brew "helm"
# brew "k3d"
# brew "kind"
# brew "kubernetes-cli"

# developer tooling
brew "nginx"
cask "inso"
cask "ngrok"

# Utils
brew "readline"
brew "jq"
brew "libyaml"
brew "imagemagick"
brew "gpg"

# caribou local stack bits
# brew "argo"
# brew "heroku/brew/heroku"
# brew "redis"
brew "pgcli"
brew "libpq"
# brew "postgresql@12"
# brew "psqlodbc"

# misc / to categorize
# brew "autoconf"
# brew "automake"
# brew "coreutils"
# brew "glib"
# brew "sqlite"
# brew "httpie"
# brew "libheif"
# brew "tcl-tk"
# brew "libtool"
# brew "libksba"
# brew "pkg-config"
# cask "adoptopenjdk11"
# cask "chromedriver"
# cask "stack"

