

tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "argo"
brew "autoconf"
brew "automake"
brew "contentful-cli"
brew "coreutils"
brew "gh"
brew "glib"
brew "go"
brew "helm"
brew "readline"
brew "sqlite"
brew "httpie"
brew "hub"
brew "python@3.9"
brew "libheif"
brew "tcl-tk"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "libksba"
brew "libyaml"
brew "neovim"
brew "nginx"
brew "pkg-config"
brew "postgresql@12", restart_service: true
brew "psqlodbc"
cask "adoptopenjdk11"
cask "chromedriver"
cask "stack"

# node
brew "nvm"
brew "yarn"

# vim plugin needs
brew "zlib"
brew "the_silver_searcher"


# Caribou Needs
brew "fzf"
brew "heroku/brew/heroku"
brew "redis", restart_service: true


# Developer Tooling
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
cask "inso"
cask "ngrok"
